<?php

declare(strict_types=1);

namespace App\Dashboard\Presentation\Web;

use Symfony\Bundle\FrameworkBundle\Controller\AbstractController;
use Symfony\Component\HttpFoundation\Response;
use Symfony\Component\Routing\Annotation\Route;
use Symfony\Component\Routing\Generator\UrlGeneratorInterface;

final class PrivacyAction extends AbstractController
{
    public function __construct(
        private readonly string $appName,
        private readonly string $supportEmail,
    ) {
    }

    #[Route('/privacy', name: 'privacy')]
    public function __invoke(UrlGeneratorInterface $generator): Response
    {
        $content = " <h1>Політика конфіденційності</h1>

                <p>Користувачі можуть надавати Дані самостійно шляхом розміщення таких даних на Порталі або повідомляючи через канали телефонного зв'язку та/або на електронну та/або поштову адресу Товариства, або Дані можуть надаватися із інших джерел (у відповідності з п. 3 даної Політики) наприклад, з відгуків Користувачів (оцінка, коментарі, підтвердження інформації) або інша інформація від третіх осіб надана в ході направлення претензій, скарг та/або при розгляді спорів, та/або інформація із загальновідомих джерел в мережі Інтернет.</p>

                <p>Користувач не має права використовувати сайт {company_name}, якщо він не погоджується з умовами даної Політики.</p>

                <p>Користувач визнає, що у випадку його недбалого ставлення до безпеки і захисту своїх Даних і даних по авторизації (пароль, логін) треті особи можуть отримати несанкціонований доступ до облікового запису і Даних Користувача. Компанія не несе відповідальності за збитки, завдані таким Доступом.</p>

                <h2>Які Дані можуть збиратися</h2>
                <p>Компанія може збирати наступні Дані:</p>
                <ul>
                    <li>ім'я, прізвище, по батькові, дата народження, адреса фактичного проживання, місце реєстрації, стать, сімейний стан, номер (та серію) паспорту або іншого документу, що посвідчує особу, строк його дії, фотографія, дані уповноваженої особи компанії, найменування компанії, реквізити компанії, контактні телефони, адреса електронної пошти, адреса місцезнаходження компанії, інші контакті дані за бажанням Користувача;</li>
                    <li>інформація про обліковий запис Користувача в тому числі номер телефону, адреса електронної пошти, логін та пароль, інші Дані, необхідні для здійснення обслуговування Користувачів Порталу, комунікації з Користувачами в тому числі, коли Користувач звертається в службу підтримку Порталу;</li>
                    <li>інформація, яку Користувачі надають Товариству при укладанні договорів про надання послуг шляхом акцепту публічної оферти, розміщеної на Порталі та/або укладаючи договори про надання додаткових послуг на Порталі;</li>
                    <li>інформація, яка необхідна для здійснення комунікації між Користувачами Порталу в тому числі для здійснення і підтвердження замовлень між Замовниками та Виконавцями, отримання і відправки повідомлень, розміщення відгуків, коментарів, здійснення платежів;</li>
                    <li>дані про пристрої, що використовуються Користувачами, інформація про мобільні Дані Користувачів;</li>
                    <li>дані, отримані в результаті проведення Компанією та/або третіми уповноваженими Компанією особи різних опитувань;</li>
                    <li>інформація, розміщена Користувачами по результатам їх обслуговування, відгуки, коментарі, звернення в службу підтримку клієнтів, скарги, претензії, інші звернення.</li>
                </ul>

                <h2>Технології збору даних</h2>
                <p>Компанія також може обробляти Дані за допомогою наступних технологій:</p>
                <ul>
                    <li>файли Cookies (кукі- невеликий фрагмент даних, які пересилаються на комп'ютер Користувача при переході на веб-сторінку та/або при перегляді рекламного модуля на веб-сторінці і зберігаються на комп'ютері Користувача та/або в його мобільному пристрої);</li>
                    <li>пікселі (pixels – цифрові зображення, елемент матриці дисплеїв, що формують зображення).</li>
                </ul>

                <h2>Використання і цілі обробки Даних</h2>
                <p>Компанія використовує та здійснює обробку Даних, в наступних цілях:</p>
                <ul>
                    <li>здійснення покладених на Компанію функцій, повноважень та обов'язків у відповідності до діючого законодавства країни в якiй надаються послуги;</li>
                    <li>для реєстрації, ідентифікації клієнта як Користувача Порталу;</li>
                    <li>для надання послуг, обробки платежів, проведення розрахункових операцій;</li>
                    <li>для покращення якості надання послуг, формування рейтингів, аналізу активності Користувачів.</li>
                </ul>

                <h2>Умови надання доступу до Даних</h2>
                <p>Розкриття Даних відбувається при розміщенні Виконавцем Оголошення, розміщенні Виконавцем пропозиції на адресу Замовника, розміщенні Завдання Замовником, акцепту пропозиції Виконавця Замовником Завдання або програмою Сайту автоматично на сайті {company_name}, але тільки в об'ємі необхідному для ідентифікації Користувача та завдання.</p>

                <h2>Як змінити/видалити Дані або відкликати згоду</h2>
                <p>Користувачі в будь-який момент можуть змінити/видалити особисту інформацію або відмовитися від розсилки, або відкликати згоду на обробку Даних через свій Особистий кабінет або, відправивши повідомлення на електронну адресу: {support_email} або поштову адресу {company_address}.</p>

                <h2>Захист Даних</h2>
                <p>Компанія, при обробці Даних застосовує всі необхідні технічні, організаційні, правові заходи для захисту Даних від неправомірного та/або несанкціонованого доступу до таких Даних, в тому числі від змін, видалення, надання, розповсюдження, а також інших неправомірних дій.</p>

                <h2>Додаткові умови</h2>
                <p>Компанія залишає за собою право змінити умови даної Політики в будь-який момент. В такому випадку, оновлена редакція буде розміщена на сторінці за адресою: {privacy_url}. У випадку, якщо Користувач не погоджується із змінами, він зобов'язується негайно припинити будь-яку взаємодію з Порталом.</p>
            ";

        return $this->render('@Dashboard/privacy.html.twig', [
            'content' => str_replace(
                [
                    '{company_name}',
                    '{support_email}',
                    '{company_address}',
                    '{privacy_url}',
                ],
                [
                    $this->appName,
                    $this->supportEmail,
                    'м.Золотоноша, вул. Пушкина 11',
                    $generator->generate('privacy', [], UrlGeneratorInterface::ABSOLUTE_URL),
                ],
                $content,
            ),
        ]);
    }
}
